//Вариант проекта 2. Автомобили.
//Суть тествого задания - показать знания разработчика.
//Использованы в ТЗ были принципы ООП, SOLID, DI паттерн и фабрика.
//Изначально проект выполнялся по принципу ECS с фреймоврком
//LeoEcsLite и LeoEcsDi, но из-за абстрактной задачи отказался от идеи.

//Проект билдится, но, к сожалению, нет никакой привязки к UI и клавиатуре, поэтому 
//выполнение ТЗ можно оценить только по коду.

//Класс Program - старт проекта.

//Благодарю за ваше потраченное время на рассмотр проекта.
//Буду очень благодарен фидбеку и получению нового опыта. Приятного рассмотрения! =)

using SaberTestWork;

class Program
{
    static void Main(string[] args)
    {
        Game game = new Game();
    }
}